holographicSol/SatIO_ESP32-P4/SatIO/src/main.cpp
/*

  SatIO - Written by Benjamin Jack Cullen.

-----

  A general purpose programmable I/O platform for automation, throughput and LLM's.

  A huge matrix switch in a small package, supporting stacks of logic across
  70 output pins and 100 mapping slots.

-----

  Inference in Bayesian Reasoning? Moon tracking for example can be used to track the
  moon, it can also be used for one example; to track the tides, if the system is aware of
  moon/planetary positioning and datetime then marine life values may also be inferred
  relative to the inferred tide values and known datetime. There is a lot of data that
  can be used in many ways, with a kind of network effect.

-----

  Wiring For Keystudio ESP32 PLUS Development Board:

          ESP32: 1st ATMEGA2560 with shield as Output Port Controller (not on multiplexer):
          ESP32: IIC 1 SDA as io4 -> ATMEGA2560: I2C SDA
          ESP32: IIC 1 SCL as io5 -> ATMEGA2560: I2C SCL

          ESP32: 2nd ATMEGA2560 with shield as Input Port Controller (not on multiplexer):
          ESP32: IIC 2 SDA as io7 -> ATMEGA2560: I2C SDA
          ESP32: IIC 2 SCL as io8 -> ATMEGA2560: I2C SCL

          Other ESP32 I2C DS3231 (not on multiplexer) (5v):
          ESP32: IIC 0 SDA as io2 -> DS3231 (RTC): SDA
          ESP32: IIC 0 SCL as io3 -> DS3231 (RTC): SCL

          ESP32 i2C: I2C Multiplexing (3.3v):
          ESP32: IIC 0 SDA as io2 -> TCA9548A: SDA
          ESP32: IIC 0 SCL as io3 -> TCA9548A: SCL

          ESP32: Analog/Digital Multiplexing (3.3v):
          ESP32: io53   -> CD74HC4067: SIG
          ESP32: io23   -> CD74HC4067: S0
          ESP32: io22   -> CD74HC4067: S1
          ESP32: io21   -> CD74HC4067: S2
          ESP32: io20   -> CD74HC4067: S3

          ESP32: WTGPS300P (5v):
          ESP32: io27 RXD -> WTGPS300P: TXD
          ESP32: null TXD -> WTGPS300P: RXD

          ESP32: WT901 9-Axis Gyro:
          ESP32: Serial2 RXD -> WT901 TXD
          ESP32: Serial2 TXD -> WT901 RXD

-----

    To Do: AI I2C modules returning int's as classifiers.
    To Do: SRTM data. Use NASA shuttle radar topographical mission data.
    To Do: Ability to add custom IIC sensor modules after flashing.
    To Do: PCB fabrication.

-----

  There are some required custom libs included in complete project files:
  https://drive.google.com/drive/folders/13yynSxkKL-zxb7iLSkg0v0VXkSLgmtW-?usp=sharing

-----
*/

#include <stdio.h>
#include <limits.h>
#include <string.h>
#include <iostream>
#include <assert.h>
#include <float.h>
#include <math.h>

#include <Arduino.h>
#include <Wire.h>
               
#include "./config.h"
#include "./REG.h"
#include "./strval.h"
#include "./meteors.h"
#include "./wtgps300p.h"
#include "./wt901.h"
#include "./multiplexers.h"
#include "./esp32_helper.h"
#include "./sidereal_helper.h"
#include "./hextodig.h"
#include "./ins.h"
#include "./satio.h"
#include "./custommapping.h"
#include "./matrix.h"
#include "./serial_infocmd.h"
#include "./system_data.h"
#include "./sdmmc_helper.h"

#include <sys/time.h>
#include <rtc_wdt.h>
#include <esp_task_wdt.h>
#include "esp_pm.h"
#include "esp_attr.h"
#include "esp_log.h"
#include "esp_partition.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_partition.h"
#include "esp_spiffs.h"
#include "esp_heap_caps.h"
#include "nvs_flash.h"
#include "esp_system.h"
#include "driver/uart.h"
#include "SPIFFS.h"

TaskHandle_t TaskGPS;
TaskHandle_t TaskUniverse;
TaskHandle_t TaskMultiplexers;
TaskHandle_t TaskGyro;
TaskHandle_t TaskSwitches;
TaskHandle_t TaskPortControllerInput;
TaskHandle_t TaskSerialInfoCMD;
TaskHandle_t TasKSystemTiming;
TaskHandle_t TaskStorage;

int DELAY_TASK_SYSTEM_TIMING=1;
int DELAY_TASK_SERIAL_INFOCMD=1;
int DELAY_TASK_MULTIPLEXERS=1;
int DELAY_TASK_GYRO0=1;
int DELAY_TASK_UNIVERSE=500;
int DELAY_TASK_GPS=1;
int DELAY_TASK_SWITCHES=1;
int DELAY_TASK_PORTCONTROLLER_INPUT=false;
int DELAY_TASK_STORAGE=1000;
bool TICK_DELAY_TASK_SYSTEM_TIMING=false;
bool TICK_DELAY_TASK_SERIAL_INFOCMD=false;
bool TICK_DELAY_TASK_MULTIPLEXERS=false;
bool TICK_DELAY_TASK_GYRO0=false;
bool TICK_DELAY_TASK_UNIVERSE=false;
bool TICK_DELAY_TASK_GPS=false;
bool TICK_DELAY_TASK_SWITCHES=false;
bool TICK_DELAY_TASK_PORTCONTROLLER_INPUT=false;
bool TICK_DELAY_TASK_STORAGE=false;
bool global_task_sync=false;
long system_sync_retry_max=2000;

/**
 * Syncronize Taks.
 * 
 * @brief Time syncronize tasks.
 */
void syncTasks() {
  Serial.println("[syncronizing system] please wait");
  global_task_sync=false;
  while (satioData.sync_rtc_immediately_flag==true) {
    getSystemTime();
    system_sync_retry_max--;
    if (system_sync_retry_max<=0)
      {Serial.println("[sync] took too long"); break;}
    delay(1);
  }
  global_task_sync=true;
  // Serial.println("unixtime sync: " + String(satioData.local_unixtime_uS));
}

/**
 * Storage Task.
 * 
 * @brief Performas many operations including:
 *  (1) Card insertion checks.
 *  (2) Mount automatically.
 *  (3) Unmount automatically.
 *  (4) Read/write operations.
 *  (5) Other storage operations.
 *  (6) Powers down the sdcard when not in use. 
 */
void taskStorage(void * pvParameters) {
  esp_task_wdt_add(nullptr);
  while (global_task_sync==false) {vTaskDelay(1);}
  while (1) {
    esp_task_wdt_reset();
    // ------------------------------------------------
    // SDCard Begin
    // ------------------------------------------------
    sdcardBegin();
    // statSDCard(); // uncomment to debug
    // ------------------------------------------------
    // Check Flags
    // ------------------------------------------------
    sdcardFlagHandler();
    // ------------------------------------------------
    // Power Down and persist sdcard data
    // ------------------------------------------------
    sdcardSleepMode0();
    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_STORAGE==false)
      {vTaskDelay(DELAY_TASK_STORAGE / portTICK_PERIOD_MS);}
    else {vTaskDelay(DELAY_TASK_STORAGE);}
  }
}

/**
 * GPS Task.
 * 
 * @brief Performas many operations including:
 *  (1) Collects, validates and stores GPS data.
 *  (2) Syncs INS data on successful validation.
 * Consider renaming task to something like 'time and location'
 */
void taskGPS(void * pvParameters) {
  esp_task_wdt_add(nullptr);
  while (1) {
    esp_task_wdt_reset();
    // ------------------------------------------------
    // Get, check and set gps data.
    // ------------------------------------------------
    readGPS();
    validateGPSData();
    // ------------------------------------------------
    // Set SatIO data.
    // ------------------------------------------------
    if (((gnggaData.valid_checksum=true) &&
        (gnrmcData.valid_checksum=true) &&
        (gpattData.valid_checksum=true)) ||
        satioData.set_rtc_datetime_flag==true) {
        setSatIOData();
        // --------------------------------------------
        // Set INS data.
        // --------------------------------------------
        // set_ins(satioData.degrees_latitude,
        //         satioData.degrees_longitude,
        //         atof(gnggaData.altitude),
        //         atof(gnrmcData.ground_heading),
        //         atof(gnrmcData.ground_speed),
        //         atof(gnggaData.gps_precision_factor),
        //         gyroData.gyro_0_ang_z);
        set_ins(satioData.degrees_latitude,
                satioData.degrees_longitude,
                satioData.altitude_converted,
                satioData.ground_heading,
                satioData.speed_converted,
                atof(gnggaData.gps_precision_factor),
                gyroData.gyro_0_ang_z);
        // --------------------------------------------
        // Count reads.
        // --------------------------------------------
        systemData.i_count_read_gps++;
        systemData.interval_breach_gps = 1;
        if (systemData.i_count_read_gps>=UINT32_MAX-2)
          {systemData.i_count_read_gps=0;}
    }
    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_GPS==false)
      {vTaskDelay(DELAY_TASK_GPS / portTICK_PERIOD_MS);}
    else {vTaskDelay(DELAY_TASK_GPS);}
  }
}

/**
 * Gyro Task.
 * 
 * @brief Reads and stores gyroscopic data.
 */
void taskGyro(void * pvParameters) {
  esp_task_wdt_add(nullptr);
  while (global_task_sync==false) {vTaskDelay(1);}
  while (1) {
    esp_task_wdt_reset();
    if (readGyro()==true) {
      systemData.i_count_read_gyro_0++;
      systemData.interval_breach_gyro_0 = 1;
      if (systemData.i_count_read_gyro_0>=UINT32_MAX-2)
        {systemData.i_count_read_gyro_0=0;}
      // ----------------------------------------------
      // Estimate INS data.
      // INS data is fed bsck into INS.
      // ----------------------------------------------
      if (systemData.interval_breach_gyro_0==true) {
      // if (ins_estimate_position(gyroData.gyro_0_ang_y,
      //                           gyroData.gyro_0_ang_z,
      //                           atof(gnrmcData.ground_heading),
      //                           atof(gnrmcData.ground_speed),
      //                           satioData.local_unixtime_uS)==true) {
      //                           systemData.i_count_read_ins++;
      //                           systemData.interval_breach_ins=1;
      //                           if (systemData.i_count_read_ins>=UINT32_MAX-2)
      //                             {systemData.i_count_read_ins=0;}}
      if (ins_estimate_position(gyroData.gyro_0_ang_y,
                          gyroData.gyro_0_ang_z,
                          satioData.ground_heading,
                          satioData.speed_converted,
                          satioData.local_unixtime_uS)==true) {
                          systemData.i_count_read_ins++;
                          systemData.interval_breach_ins=1;
                          if (systemData.i_count_read_ins>=UINT32_MAX-2)
                            {systemData.i_count_read_ins=0;}}
      }
    }
    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_GYRO0==false)
      {vTaskDelay(DELAY_TASK_GYRO0 / portTICK_PERIOD_MS);}
    else {vTaskDelay(DELAY_TASK_GYRO0);}
  }
}

/**
 * Universe Task.
 * 
 * @brief Stores various information about the universe!
 */
void taskUniverse(void * pvParameters) {
  esp_task_wdt_add(nullptr);
  while (global_task_sync==false) {vTaskDelay(1);}
  while (1) {
    esp_task_wdt_reset();
    // ------------------------------------------------
    // Track Home Sun, Moon & Planets.
    // ------------------------------------------------
    trackPlanets(satioData.degrees_latitude,
                 satioData.degrees_longitude,
                 satioData.rtc_year,
                 satioData.rtc_month,
                 satioData.rtc_mday,
                 satioData.rtc_hour,
                 satioData.rtc_minute,
                 satioData.rtc_second,
                 satioData.local_hour,
                 satioData.local_minute,
                 satioData.local_second,
                 atol(gnggaData.altitude));
    systemData.i_count_track_planets++;
    systemData.interval_breach_track_planets = 1;
    if (systemData.i_count_track_planets>=UINT32_MAX-2)
      {systemData.i_count_track_planets=0;}
    // ------------------------------------------------
    // Track Meteors.
    // ------------------------------------------------
    setMeteorShowerWarning(satioData.local_month,
                           satioData.local_mday);
    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_UNIVERSE==false)
      {vTaskDelay(DELAY_TASK_UNIVERSE / portTICK_PERIOD_MS);}
    else {vTaskDelay(DELAY_TASK_UNIVERSE);}
  }
}

/**
 * Switch Task.
 * 
 * @brief Performs various operations including:
 *  (1) Martix calculations.
 *  (2) Mapping values.
 *  (3) Sets output values.
 *  (4) Instructing the portcontroller accordingly.
 */
// int i_count_input_values=0;
void taskSwitches(void * pvParameters) {
  esp_task_wdt_add(nullptr);
  while (global_task_sync==false) {vTaskDelay(1);}
  while ((1)) {
    esp_task_wdt_reset();
    if (matrixSwitch()) {
      systemData.i_count_matrix++;
      if (systemData.i_count_matrix>=UINT64_MAX-2)
        {systemData.i_count_matrix=0;}
    }
    map_values();
    setOutputValues();
    writeOutputPortControllerM1();
    SwitchStat();
    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_SWITCHES==false)
      {vTaskDelay(DELAY_TASK_SWITCHES / portTICK_PERIOD_MS);}
    else {vTaskDelay(DELAY_TASK_SWITCHES);}
  }
}

/**
 * Port Controller Input Task.
 * 
 * @brief Reads pins on portcontroller.
 */
// int i_count_input_values=0;
void taskPortControllerInput(void * pvParameters) {
  esp_task_wdt_add(nullptr);
  while (global_task_sync==false) {vTaskDelay(1);}
  while ((1)) {
    esp_task_wdt_reset();
    if (readInputPortControllerM1()) {
      systemData.i_count_portcontroller_input++;
      if (systemData.i_count_portcontroller_input>=UINT64_MAX-2)
        {systemData.i_count_portcontroller_input=0;}
    }
    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_PORTCONTROLLER_INPUT==false)
      {vTaskDelay(DELAY_TASK_PORTCONTROLLER_INPUT / portTICK_PERIOD_MS);}
    else {vTaskDelay(DELAY_TASK_PORTCONTROLLER_INPUT);}
  }
}


