holographicSol/SatIO_ESP32-P4/SatIO/src/main.cpp
int i_chan=0;
/**
 * Multiplexer Task.
 * 
 * @brief Any reads/writes to multiplexers occur on this task.
 */
void taskMultiplexers(void * pvParameters) {
  esp_task_wdt_add(nullptr);
  while (global_task_sync==false) {vTaskDelay(1);}
  while (1) {
    esp_task_wdt_reset();
    // ------------------------------------------------
    // Step over analog/digital multiplexer channela
    // ------------------------------------------------
    for (i_chan=0; i_chan < 16; i_chan++) {
      // ------------------------------------------------
      // Set multiplexer channel.
      // ------------------------------------------------
      setMultiplexChannel_AD(0, i_chan);
      multiplexerData.ADMPLEX_0_DATA[i_chan]=analogRead(ADMPLEX_0_SIG);
    }
    // ------------------------------------------------
    // Count reads.
    // ------------------------------------------------
    systemData.i_count_read_mplex++;
    systemData.interval_breach_mplex = 1;
    if (systemData.i_count_read_mplex>=UINT32_MAX-2)
      {systemData.i_count_read_mplex=0;}
    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_MULTIPLEXERS==false)
      {vTaskDelay(DELAY_TASK_MULTIPLEXERS / portTICK_PERIOD_MS);}
    else {vTaskDelay(DELAY_TASK_MULTIPLEXERS);}
  }
}

/**
 * Info Command Task.
 * 
 * @brief Processes a serial TXD and RXD operations:
 *  (1) Information out for other system and debug.
 *  (2) Commands in.
 */
void taskSerialInfoCMD(void * pvParameters) {
  esp_task_wdt_add(nullptr);
  while (global_task_sync==false) {vTaskDelay(1);}
  while (1) {
    esp_task_wdt_reset();
    // ------------------------------------------------
    // Note that stat is ran in main loop, not here.
    // ------------------------------------------------
    CmdProcess();
    outputSentences();
    // ------------------------------------------------
    // Delay next iteration of task.
    // ------------------------------------------------
    if (TICK_DELAY_TASK_SERIAL_INFOCMD==false)
      {vTaskDelay(DELAY_TASK_SERIAL_INFOCMD / portTICK_PERIOD_MS);}
    else {vTaskDelay(DELAY_TASK_SERIAL_INFOCMD);}
  }
}

/**
 * @brief Setup
 */
void setup() {
  // --------------------------------------------------------------
  // Required for operations in taks that may take longer than 5s..
  // --------------------------------------------------------------
  esp_task_wdt_config_t config = {
    .timeout_ms = 60* 1000, // 20 seconds
    .trigger_panic = true,  // Trigger panic if watchdog timer not reset
  };
  esp_task_wdt_reconfigure(&config);
  enableLoopWDT();
  // --------------------------------------------------------------
  // Warmup delay: some devices require at least one second start.
  // --------------------------------------------------------------
  delay(1000);
  // --------------------------------------------------------------
  // Initialize Pins.
  // --------------------------------------------------------------
  pinMode(ADMPLEX_0_S0, OUTPUT); 
  pinMode(ADMPLEX_0_S1, OUTPUT); 
  pinMode(ADMPLEX_0_S2, OUTPUT); 
  pinMode(ADMPLEX_0_S3, OUTPUT); 
  pinMode(ADMPLEX_0_SIG, INPUT); 

  analogReadResolution(16);
  analogSetAttenuation(ADC_11db);   // 0–3.3 V range

  digitalWrite(ADMPLEX_0_S0, LOW);
  digitalWrite(ADMPLEX_0_S1, LOW);
  digitalWrite(ADMPLEX_0_S2, LOW);
  digitalWrite(ADMPLEX_0_S3, LOW);
  // --------------------------------------------------------------
  // Initialize Serial 0.
  // --------------------------------------------------------------
  Serial.setRxBufferSize(2000); // ensure this is set before begin()
  Serial.setTimeout(50); // ensure this is set before begin()
  Serial.begin(921600); while(!Serial);
  Serial.flush();
  Serial.println();
  Serial.println();
  Serial.println("[SERIAL] (Commands and general output)");
  Serial.println("[SERIAL] Baud rate: 921600");

  // --------------------------------------------------------------
  // System Information.
  // --------------------------------------------------------------
  Serial.println("[xPortGetCoreID] " +
    String(xPortGetCoreID()));
  Serial.println("[ESP_PM_CPU_FREQ_MAX] " +
    String(ESP_PM_CPU_FREQ_MAX));
  Serial.println("[ESP_PM_APB_FREQ_MAX] " +
    String(ESP_PM_APB_FREQ_MAX));
  Serial.println("[ESP_PM_NO_LIGHT_SLEEP] " +
    String(ESP_PM_NO_LIGHT_SLEEP));
  Serial.println("[CONFIG_ESPTOOLPY_FLASHFREQ] " +
    String(CONFIG_ESPTOOLPY_FLASHFREQ));
  Serial.println("[CONFIG_ESPTOOLPY_FLASHMODE] " +
    String(CONFIG_ESPTOOLPY_FLASHMODE));
  Serial.println("[CONFIG_LOG_DEFAULT_LEVEL] " +
    String(CONFIG_LOG_DEFAULT_LEVEL));
  Serial.println("[CONFIG_BOOTLOADER_LOG_LEVEL] " +
    String(CONFIG_BOOTLOADER_LOG_LEVEL));
  Serial.println("[CONFIG_ESP_CONSOLE_UART_BAUDRATE] " +
    String(CONFIG_ESP_CONSOLE_UART_BAUDRATE));
  Serial.println("[CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL] " +
    String(CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL));
  Serial.println("[getCpuFrequencyMhz] " +
    String(getCpuFrequencyMhz()));
  Serial.println("[APB_CLK_FREQ] " +
    String(getApbFrequency()));
  // --------------------------------------------------------------
  // Initialize NVS.
  // --------------------------------------------------------------
  esp_err_t ret = nvs_flash_init();
  if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
      ret = nvs_flash_init();}
  if (ret != ESP_OK) {printf("NVS init failed: %s\n", esp_err_to_name(ret));}
  // --------------------------------------------------------------
  // Initialize SPIFFS.
  // --------------------------------------------------------------
  Serial.println("[SPIFFS] attempting to mount");
  if(!SPIFFS.begin(FORMAT_SPIFFS_IF_FAILED, "/INTERNAL")){
      Serial.println("[SPIFFS] Mount Failed");
   }
  else {Serial.println("[SPIFFS] mounted successfully");}
  print_partition_table();
  print_ram_info();
  // --------------------------------------------------------------
  // Initialize SDCard and attempt to load files.
  // --------------------------------------------------------------
  sdcardBegin();
  sdmmcFlagData.load_system=true;
  sdcardFlagHandler();
  if (matrixData.load_matrix_on_startup) {
    sdmmcFlagData.load_mapping=true; sdcardFlagHandler();
    sdmmcFlagData.load_matrix=true; sdcardFlagHandler();}

  // --------------------------------------------------------------
  // Initialize I2C.
  // --------------------------------------------------------------
  Serial.println("[IIC] starting IIC as master");

