holographicSol/SatIO_ESP32-P4/SatIO/src/main.cpp
  initInputPortController();
  initOutputPortController();
  // Wire.setClock(1000000);
  // Wire.setClock(800000L);
  // Wire.setClock(400000);
  // Wire.setClock(200000);
  // Wire.setClock(100000L);
  writeOutputPortControllerM0();

  // --------------------------------------------------------------
  // Analog/Digital Multiplexers(s).
  // --------------------------------------------------------------
  // Serial.println("[AD] setting analog/digital multiplexer channel: 0");
  // setMultiplexChannel_AD(0, 0);
  // --------------------------------------------------------------
  // Initialize I2C Multiplexer(s).
  // --------------------------------------------------------------
  Serial.println("[IIC] setting IIC multiplexer channel: 0");
  // setMultiplexChannel_I2C(0, 0);
  // --------------------------------------------------------------
  // Initialize RTC (for UTC).
  // --------------------------------------------------------------
  Serial.println("[IIC] starting RTC");
  initRTC();
  // --------------------------------------------------------------
  // Initialize System Time (for local time).
  // --------------------------------------------------------------
  initSystemTime();
  // --------------------------------------------------------------
  // Initialize Serial 1 (for GPS).
  // --------------------------------------------------------------
  Serial.println("[SERIAL1] (GPS)");
  Serial1.setPins(36, -1, -1, -1); // ensure this is set before begin()
  Serial1.setRxBufferSize(2000); // ensure this is set before begin()
  Serial1.setTimeout(10); // ensure this is set before begin()
  Serial1.begin(115200); while(!Serial1);
  Serial1.flush();
  Serial.println("[SERIAL1] Baud rate: 115200");
  Serial.println("[SERIAL1] (hardware serial remap: Rx=36 Tx=-1)");
  // --------------------------------------------------------------
  // Initialize Serial 2 (for 9-Axis Gyro).
  // --------------------------------------------------------------
  Serial.println("[SERIAL2] (9-Axis Gyro)");
  Serial2.setPins(33, 32, -1, -1); // ensure this is set before begin()
  Serial2.setRxBufferSize(2000); // ensure this is set before begin()
  Serial2.setTimeout(1000); // ensure this is set before begin()
  Serial2.flush();
  Serial.println("[SERIAL2] (hardware serial remap: Rx=33 Tx=32)");
	Serial.println("[SERIAL2] initializing Gyro0");
  initWT901();

  delay(1000);
  // --------------------------------------------------------------
  // xTask Storage.
  // --------------------------------------------------------------
  DELAY_TASK_STORAGE=500;       // delay time/ticks
  TICK_DELAY_TASK_STORAGE=false; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskStorage,   /* Function to implement the task */
    "TaskStorage", /* Name of the task */
    4096,          /* Stack size in words */
    NULL,          /* Task input parameter */
    2,             /* Priority of the task */
    &TaskStorage,  /* Task handle. */
    0);            /* Core where the task should run */
    delay(50);     /* delay between task creation */
  vTaskSuspend(TaskStorage);
  // --------------------------------------------------------------
  // xTask GPS.
  // --------------------------------------------------------------
  DELAY_TASK_GPS=1;         // delay time/ticks
  TICK_DELAY_TASK_GPS=true; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskGPS,   /* Function to implement the task */
    "TaskGPS", /* Name of the task */
    4096,      /* Stack size in words */
    NULL,      /* Task input parameter */
    3,         /* Priority of the task */
    &TaskGPS,  /* Task handle. */
    0);        /* Core where the task should run */
    delay(50); /* delay between task creation */
  // vTaskSuspend(TaskGPS);
  // --------------------------------------------------------------
  // xTask Serial Information Command.
  // --------------------------------------------------------------
  DELAY_TASK_SERIAL_INFOCMD=1;         // delay time/ticks
  TICK_DELAY_TASK_SERIAL_INFOCMD=true; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskSerialInfoCMD,   /* Function to implement the task */
    "TaskSerialInfoCMD", /* Name of the task */
    16384,                /* Stack size in words */
    NULL,                /* Task input parameter */
    3,                   /* Priority of the task */
    &TaskSerialInfoCMD,  /* Task handle. */
    0);                  /* Core where the task should run */
    delay(50);           /* delay between task creation */
  // vTaskSuspend(TaskSerialInfoCMD);
  // --------------------------------------------------------------
  // xTask Multiplexers.
  // --------------------------------------------------------------
  DELAY_TASK_MULTIPLEXERS=1;          // delay time/ticks
  TICK_DELAY_TASK_MULTIPLEXERS=true; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskMultiplexers,   /* Function to implement the task */
    "TaskMultiplexers", /* Name of the task */
    4096,               /* Stack size in words */
    NULL,               /* Task input parameter */
    4,                  /* Priority of the task */
    &TaskMultiplexers,  /* Task handle. */
    1);                 /* Core where the task should run */
    delay(50);          /* delay between task creation */
  vTaskSuspend(TaskMultiplexers);
  // --------------------------------------------------------------
  // xTask Gyro.
  // --------------------------------------------------------------
  DELAY_TASK_GYRO0=1;         // delay time/ticks
  TICK_DELAY_TASK_GYRO0=true; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskGyro,   /* Function to implement the task */
    "TaskGyro", /* Name of the task */
    4096,       /* Stack size in words */
    NULL,       /* Task input parameter */
    3,          /* Priority of the task */
    &TaskGyro,  /* Task handle. */
    0);         /* Core where the task should run */
    delay(50);  /* delay between task creation */
  vTaskSuspend(TaskGyro);
  // --------------------------------------------------------------
  // xTask Universe.
  // --------------------------------------------------------------
  myAstroBegin(); // call helper library begin function
  DELAY_TASK_UNIVERSE=1000;       // delay time/ticks
  TICK_DELAY_TASK_UNIVERSE=false; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskUniverse,   /* Function to implement the task */
    "TaskUniverse", /* Name of the task */
    16384,          /* Stack size in words */
    NULL,           /* Task input parameter */
    1,              /* Priority of the task */
    &TaskUniverse,  /* Task handle. */
    0);             /* Core where the task should run */
    delay(50);      /* delay between task creation */
  vTaskSuspend(TaskUniverse);
  // --------------------------------------------------------------
  // xTask TaskSwitches.
  // --------------------------------------------------------------
  DELAY_TASK_SWITCHES=1;         // delay time/ticks
  TICK_DELAY_TASK_SWITCHES=true; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskSwitches,   /* Function to implement the task */
    "TaskSwitches", /* Name of the task */
    4096,           /* Stack size in words */
    NULL,           /* Task input parameter */
    4,              /* Priority of the task */
    &TaskSwitches,  /* Task handle. */
    0);             /* Core where the task should run */
  delay(50);        /* delay between task creation */
  vTaskSuspend(TaskSwitches);

  // --------------------------------------------------------------
  // xTask TaskSwitches.
  // --------------------------------------------------------------
  DELAY_TASK_PORTCONTROLLER_INPUT=1;         // delay time/ticks
  TICK_DELAY_TASK_PORTCONTROLLER_INPUT=true; // false for millisecond delay
  xTaskCreatePinnedToCore(
    taskPortControllerInput,   /* Function to implement the task */
    "TaskPortControllerInput", /* Name of the task */
    4096,           /* Stack size in words */
    NULL,           /* Task input parameter */
    4,              /* Priority of the task */
    &TaskPortControllerInput,  /* Task handle. */
    0);             /* Core where the task should run */
  delay(50);        /* delay between task creation */
  vTaskSuspend(TaskPortControllerInput);

  // --------------------------------------------------------------
  // Wait for sync function to complete.
  // --------------------------------------------------------------
  syncTasks();
  // vTaskResume(TaskSerialInfoCMD);
  vTaskResume(TaskStorage);
  vTaskResume(TaskMultiplexers);
  vTaskResume(TaskGyro);
  vTaskResume(TaskUniverse);
  vTaskResume(TaskSwitches);
  vTaskResume(TaskPortControllerInput);
}

/**
 * @brief Loop
 */
void loop() {
  getSystemTime();
  systemIntervalCheck();
  intervalBreach1Second();
  systemData.loops_a_second++;
}